# Merge, concat e join

In [5]:
import pandas as pd

## Merge

In [16]:
df1 = pd.DataFrame({"A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"]},
        index = [0, 1, 2, 3])

In [17]:
df2 = pd.DataFrame({"A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"]},
        index = [4, 5, 6, 7])

In [32]:
df3 = pd.DataFrame({"A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"]},
        index = [8, 9, 10, 11])

In [29]:
df4 = pd.DataFrame({"A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"]},
        index = [0, 1, 2, 3])

In [24]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [25]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [26]:
df3

     A    B    C    D
4   A8   B8   C8   D8
5   A9   B9   C9   D9
6  A10  B10  C10  D10
7  A11  B11  C11  D11

In [27]:
pd.concat([df1, df2, df3])

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
4   A4   B4   C4   D4
5   A5   B5   C5   D5
6   A6   B6   C6   D6
7   A7   B7   C7   D7
4   A8   B8   C8   D8
5   A9   B9   C9   D9
6  A10  B10  C10  D10
7  A11  B11  C11  D11

In [30]:
pd.concat([df1, df4], axis=1)

    A   B   C   D    A    B    C    D
0  A0  B0  C0  D0   A8   B8   C8   D8
1  A1  B1  C1  D1   A9   B9   C9   D9
2  A2  B2  C2  D2  A10  B10  C10  D10
3  A3  B3  C3  D3  A11  B11  C11  D11

In [33]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

## Concat

In [42]:
esquerda = pd.DataFrame({"key": ["k0", "k1", "k2", "k3"],
                         "A": ["A0", "A1", "A2", "A3"],
                         "B": ["B0", "B1", "B2", "B3"]})
direita = pd.DataFrame({"key": ["k0", "k1", "k2", "k3"],
                         "C": ["C0", "C1", "C2", "C3"],
                         "D": ["D0", "D1", "D2", "D3"]})

In [43]:
esquerda

  key   A   B
0  k0  A0  B0
1  k1  A1  B1
2  k2  A2  B2
3  k3  A3  B3

In [44]:
direita

  key   C   D
0  k0  C0  D0
1  k1  C1  D1
2  k2  C2  D2
3  k3  C3  D3

In [45]:
pd.merge(esquerda, direita, on="key")

  key   A   B   C   D
0  k0  A0  B0  C0  D0
1  k1  A1  B1  C1  D1
2  k2  A2  B2  C2  D2
3  k3  A3  B3  C3  D3

In [51]:
esquerda = pd.DataFrame({"key1": ["k0", "k0", "k1", "k2"],
                         "key2": ["k0", "k1", "k0", "k1"],
                         "A": ["A0", "A1", "A2", "A3"],
                         "B": ["B0", "B1", "B2", "B3"]})
direita = pd.DataFrame({"key1": ["k0", "k1", "k1", "k2"],
                        "key2": ["k0", "k0", "k0", "k0"],
                         "C": ["C0", "C1", "C2", "C3"],
                         "D": ["D0", "D1", "D2", "D3"]})

In [52]:
esquerda

  key1 key2   A   B
0   k0   k0  A0  B0
1   k0   k1  A1  B1
2   k1   k0  A2  B2
3   k2   k1  A3  B3

In [53]:
direita

  key1 key2   C   D
0   k0   k0  C0  D0
1   k1   k0  C1  D1
2   k1   k0  C2  D2
3   k2   k0  C3  D3

In [54]:
pd.merge(esquerda, direita, on=["key1", "key2"])

  key1 key2   A   B   C   D
0   k0   k0  A0  B0  C0  D0
1   k1   k0  A2  B2  C1  D1
2   k1   k0  A2  B2  C2  D2

In [55]:
pd.merge(esquerda, direita,how="left", on=["key1", "key2"])

  key1 key2   A   B    C    D
0   k0   k0  A0  B0   C0   D0
1   k0   k1  A1  B1  NaN  NaN
2   k1   k0  A2  B2   C1   D1
3   k1   k0  A2  B2   C2   D2
4   k2   k1  A3  B3  NaN  NaN

In [56]:
pd.merge(esquerda, direita, how="right", on=["key1", "key2"])

  key1 key2    A    B   C   D
0   k0   k0   A0   B0  C0  D0
1   k1   k0   A2   B2  C1  D1
2   k1   k0   A2   B2  C2  D2
3   k2   k0  NaN  NaN  C3  D3

In [57]:
pd.merge(esquerda, direita, how="outer", on=["key1", "key2"])

  key1 key2    A    B    C    D
0   k0   k0   A0   B0   C0   D0
1   k0   k1   A1   B1  NaN  NaN
2   k1   k0   A2   B2   C1   D1
3   k1   k0   A2   B2   C2   D2
4   k2   k0  NaN  NaN   C3   D3
5   k2   k1   A3   B3  NaN  NaN

## Join

In [59]:
esquerda = pd.DataFrame({ "A": ["A0", "A1", "A2"],
                          "B": ["B0", "B1", "B2"]},
                        index=["k0", "k1", "k2"])

direita = pd.DataFrame({ "C": ["C0", "C2", "C3"],
                          "D": ["Dd0", "D2", "D3"]},
                        index=["k0", "k2", "k3"])

In [60]:
esquerda

     A   B
k0  A0  B0
k1  A1  B1
k2  A2  B2

In [61]:
direita

     C    D
k0  C0  Dd0
k2  C2   D2
k3  C3   D3

In [63]:
esquerda.join(direita)

     A   B    C    D
k0  A0  B0   C0  Dd0
k1  A1  B1  NaN  NaN
k2  A2  B2   C2   D2

In [64]:
esquerda.join(direita, how="outer")

      A    B    C    D
k0   A0   B0   C0  Dd0
k1   A1   B1  NaN  NaN
k2   A2   B2   C2   D2
k3  NaN  NaN   C3   D3